


// let number = Number(prompt("შეიყვანეთ რიცხვი:"))
// let sum = 0

// for (let i = 1; i <= number; i++) {
//     if (i % 2 === 0) {
//         sum += i
//     }
// }

// console.log("ლუწი რიცხვების ჯამი: " + sum)




// let myArray = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// let sum = 0

// for (let i = 0; i < myArray.length; i++) {
//   sum += myArray[i]
// }

// console.log("ჯამი:", sum)  


// 1)დაწერეთ JavaScript-ის პროგრამა რომელიც დაითვლის სიაში ელემენტების რაოდენობას, შედეგი გამოიტანეთ კონსოლში

// 2)for-ციკლის გამოყენებით იპოვეთ სიაში ყველაზე დიდი და ყველაზე პატარა რიცხვები

// 3)შექმენით სია, ამ სიაში შეინახეთ String-ტიპის მონაცემები და for-ციკლის გამოყენებით ახალ სიაში დაამატეთ ძველი სიიდან ყოველი სიტყვის პირველი ასო

// 4)შექმენით სია სადაც იქნება user-ების სახელი და გვარი და ახალ სიაში დაამატეთ ამ იუსერების  ინიციალები სახელის და გვარის პირველი ასოები, მაგალითად: გიორგი ბიბილაშვილი -> გ.ბ

// 5)Splice მეთოდის გამოყენებით ჩაანაცვლეთ სიაში ყველა უარყოფითი რიცხვი 0 - ით

// 6)შექმენით სია შეიყვანეთ user-ების სახელი და გვარი თუ user-ების სახელი და გვრი იწყება პატარა ასოთი slice-მეთოდის გამოყენებით ამოშალეთ ასეთი სახელები და გვარები სიიდან


