# 4) შექმენით დიდი სია სადაც გექნებათ ბევრი ელემენტი და შემდეგ გამოიტანთ 5 ის ჯერად ინდექსებზე მდგომ ელემენტებს


# სიის შექმნა ქალაქების სახელებით
city_list = [
    "თბილისი", "ბათუმი", "ქუთაისი", "რუსთავი", "გორი", 
    "ფოთი", "ზუგდიდი", "თელავი", "სენაკი", "ახალციხე", 
    "ბორჯომი", "ხაშური", "მცხეთა", "ყვარელი", "საგარეჯო",
    "დმანისი", "ბოლნისი", "ლაგოდეხი", "ოზურგეთი", "ჩოხატაური",
    "ამბროლაური", "წალენჯიხა", "ხონი", "მარტვილი", "აბაშა", 
    "ნინოწმინდა", "ახალქალაქი", "თიანეთი", "გუდაური", "შეკვეთილი"
]


for index in range(0, len(city_list), 5):  
    
    print(index,city_list[index])