# 1) შექმენით სია რომელშიც იქნება 15 ელემენტი შემდეგ გამოიტანეთ სიის ყველა ელემენტი while loop-ის გამოყენებით და ასევე for loop-ითაც

# 2) მომხმარებელს შეეკითხეთ სახელი შემდეგ დაბეჭდეთ ამ სახელის მესამე ასო

# 3) შექმენით სია და for loop დახმარებით გამოიტანეთ მხოლოდ ლუწი ინდექსებზე მდგომი ელემენტები


# 4) შექმენით დიდი სია სადაც გექნებათ ბევრი ელემენტი და შემდეგ გამოიტანთ 5 ის ჯერად ინდექსებზე მდგომ ელემენტებს

# 5) შექმენით სია სადაც გექნებათ  ყველა მონაცემთა ტიპის მქონე ელემენტები  შემდეგ for loop ით შეუმოწმებთ მონაცემთა ტიპებს და გამოიტანთ მხოლოდ სტრინგ ტიპის ელემენტებს

# 6) დაწერეთ პროგრამა რომელიც სიაში მყოფი ელემენტების ჯამს გამოითვლის 

# 7) შექმენით ახალი სია მხოლოდ ლუწი რიცხვების ერთი დიდი სიიდან 

# 8) გამოითვალეთ საშუალო არითმეტიკული რიცხვების სიიდან

# 9) შექმენით ცვლადები და დააჯამეთ ლუწი და კენტი რიცხვები სიიდან 

# 10) დაითვალე დადებითი და უარყოფითი რიცხვების ჯამი სიიდან
